{"columns":["Area","Date/Time \nMon-DD HH:MM","Status","Info on Electricity/Phone","Dry Areas","Areas with some water stagnation","Source"],"rows":[["ABHIRAMAPURAM/ALWARPET","Dec-03 19:00","on ground update, waterlogged heavily.\n3rd Dec 5:30 am - Water logging. people at around level have moved to higher levels.","","","",""],["ALWARTHIRUNAGAR","Dec-04 19:30","Buses fully functional from bangalore to chennai.","No Power","Nakeeran St"," mega mart area, Arcot road",""],["ADYAR","Dec-04 19:30","Gandhinagar Area: 4rd Dec, 7:30 pm - Heavy rains earlier have eased, BSNL landlines starting to work, most roads passable, Vodafone works.\nDec 3rd, 11PM: \nIIT - all reported safe, RJ Balaji. Water logging manageable.\nKarpagam Gardens -no water clogging, just no power and phone connectivity. \n6:00PM IST - Kasturba Nagar 4th and 5th main road have 2 feet water","7:30PM : Intermittent Power supply \nBSNL Landlines beginning to work","","",""],["ADAMBAKKAM","Dec-03 10:00","Water has started receding from Mount Subway and nearing areas. ","","","",""],["AIRPORT","","","","","",""],["ALAPAKKAM-MADURAVOYAL ROAD","","","","","",""],["ANNA NAGAR/MOGAPPAIR","Dec-04 09:30","Route from Anna Nagar to Koyambedu - No water. \nDec 3rd, 4:30 PM\nElectricity and phone connectivity appear to be restoring based on first hand info.\nShanthi Colony, 2 ave flooded. 1st ave is mostly dry (03/12 morning)\nsource: https://twitter.com/jananevenk/status/672235563630505984\n3rd Dec, 3 PM - West TNEB providing 2 hrs of electricity ","Power restored. ","Park road navigable.\nAnna Nagar West Extn - Dry","",""],["ANGAPUTHUR","Dec-04 09:30","Water receded in vekateshwara nagar area.","","","",""],["ASHOK NAGAR","Dec-04 11:30","Ashok Nagar Metro station is open, trains running\nDec 4th, 09:15, 2nd avenue - Shops open, groceries available, bread not available. \nThis group has a lot of info with pics on Ashok nagar\nhttps://www.facebook.com/groups/1665501917064029/?fref=ts","Dec 4th 9 am - Vodafone service seems to be working\n[https://twitter.com/RockzSuganya/status/672032074698649600]","Main Roads - 2nd, 3rd, 4th, 7th, 8th, 10th, 11th and 12th avenues, Areas around Pillar, Jawahar Vidyalaya, Papa Johns, CCD, McDonald's, 54th street near govt girls school. ","(less than 8 - 10 inches) Area near Hot Chips,  Roads off 7th ave such as 23rd, 27th, 28th, 46th, 49th streets , 18th avenue.\nWater Receding - PT Rajan Salai, 4th Avenue ",""],["AVADI","Dec-03 19:00","On ground update - No water. Power available though, but networks down.","","","",""],["BESANT NAGAR","Dec-03 11:00","2 nd cross. Customs colony safe. No basic supplies.\nBesant nagar approach through theosophical society road. All other routes have been inundated.\n","No power n mobile","","",""],["CAMP ROAD","Dec-03 05:00","Immediate to the camproad junction area, very little rain over past 12 hours. No water logging around Rajeshwari Nagar, camproad junction. ","power restored. landlines still dead.","","",""],["CHETPET","Dec-03 23:00","Roads are manageable & a few bakeries, pharmacies are open ","Electricity available. ","","",""],["CHOOLAIMEDU","Dec-04 02:00","2-3 ft water","power not restored, vodafone working, aircel reachable","","",""],["CHROMEPET","Dec-04 09:00","sundarthammal colony purushotham nagar chromepet - Chromepet area absolutely no water logging","","Chromepet area absolutely no water logging","",""],["CIT Nagar","Dec-04 08:00","Water logging receding from 3-4ft to below knee level\nDec 4, 7:15 am IST rescue available. food being distributed.\nDec 4th 4:29AM IST: Spoke to someone who answered the phones in Commissioner's office who was very patient but at the same time very generic and didn't want to get into specifics. I inquired about KK Nagar, CIT Nagar and Thoraipakkam. He said that the water level has come down drastically in the past few hours in these areas and asked not to panic if they are not accessible via phone. Everyone in these areas have been offered food and there is no power or phone line connection yet.\n","No power yet","","Water logging receding from 3-4ft to below knee level",""],["ECR","Dec-04 12:00","Most people have been evacuated or moved to higher floors in interior lanes of anna enclave, bethel nagar vettuvankeni, neelangarai, kottivakam,palavakkam on the other side of ecr road (left side while going towards the city), Iscon temple areas too. Still not safe to venture into. ","","Other side of road from what is mentioned in 'Status' and interior lanes- dry and safe","",""],["EKKATUTHANGAL","Dec-03 23:00","Kasi theatre bridge is motorable\n3rd Dec, 3PM IST - Defence Colony  - Near Kasi theatre. Personnel evacuated to Military Hospital/ Water levels still around 2.5 FT but receding.","","","",""],["EGMORE","Dec-04 09:00","Water is draining. Around 2 feet of water only. No rains last night\nMontieth road, Dec 3rd, 8.47pm: Thigh high water. Pazhamudir cholai open with no milk, bread and vegetables\\","Power available in some areas","Water is draining. Around 2 feet of water only. No rains last night","",""],["GUDUVANCHERI","","","","","",""],["GUINDY","","","","","",""],["GERUMBAKKAM","","","","","",""],["JAFFERKHANPET","Dec-03 20:30","BOATS AND NDRF IN OPERATION\nWater levels receding. Many people in the area with rescue operations, but while it is slow, good news is water levels are slowly going down.\nOkay at 3rd Dec, 2:45 pm - Water level going down slowly. Some areas are still being evacuated.","","","",""],["KILPAUK","Dec-03 21:45","Water Stagnation in New Avadi road and Water tank road.","Power available. ","","",""],["KKNAGAR","Dec-04 09:50","Dec 4, 9:50 PM - Due to today's rain there is water logging (knee level) near Double tank in R.K.Shanmugam salai. Water drained out in other areas ESI, Sivan Park, Anna main road etc.\nDry Areas : Barathidasan colony\nSome water (<8-10inches) :  mgr nagar, 9th sector.\nWater Receding :  PT Rajan\nWater logged : Lakshmanasamy,Rajamannar and Ramasamy sectors (near Pullaiyar kovil)\nDec 4th 10:00am -- PT Rajan -shops closed- no supplies \nDec 4th 7:11 AM - Electricity is back up in K.K.Nagar, but Airtel internet isn't working as of 7AM IST. Cellular signal is spotty. Domestic calls don't go through, but international calls do.\nDec 4 - 3:55 AM - -Power is restored and water levels are low. Most phone lines are still down, so please don't panic if you're unable to reach people in this area.\nDec 4 - 3:48 AM West KKNagar near Vembuliamman kovil is safe now. Control room numbers: 25615025, 25619246\nMLM super market ran out of stock\n","Power is back in some places/low network","Barathidasan colony,mgr nagar, 9th sector(very little water)","Lakshmanasamy,Rajamannar and Ramasamy sectors (near Pullaiyar kovil)",""],["KODAMBAKKAM","Dec-04 10:15","https://www.facebook.com/groups/ChennaiFloods/permalink/1686356188244972/\nDec 4th- 10:15am: Water receded and power back at Ganga Nagar near Power House, opposite to BSNL office,\nDec 4th  9:31am : Water receded from Railway Station area. Power and phone lines restored.\nDec 4th - 5:00 am: Water is completely drained on Arcot road from sekar emporium till pizza hut near Aavichi school. Roads are very bad but we can travel. Shops are all open.\n\n","Power and phone lines restored in some places. Current has been restored at R.K.Shanmugam salai, K.K. Nagar. Landline started working (only the series starting with 2366.. is working and other series not working as of now).","Ganga Nagar near Power House, Railway Station Area, Arcot road from sekar emporium till pizza hut near Aavichi schoo","",""],["KOLAPAKKAM","","https://www.facebook.com/groups/ChennaiFloods/permalink/1686342204913037/\nAs of latest reports, still pretty heavily inundated. People are ok if staying indoors.\n\n","","","",""],["KOLATHUR","Dec-03 23:00","https://www.facebook.com/groups/ChennaiFloods/permalink/1686357928244798/\nDEc 3 11:43 pm:  Ankle-deep water, power restored, limited mobile coverage\n","Power restored/limited network","","",""],["KOTHARI NAGAR","Dec-04 12:15","Dec 4th 12:15pm - Kothari Nagar safe - provisions also available. but no power and network \n","No power/network","","",""],["KOTTURPURAM","Dec-04 11:00","Dec 4th - 11 AM - Bridge still closed\nDec 4th 9:30am - DP nagar 1st and 2nd streets (which were really bad) , waters have receded significantly. Traffic is still not allowed to go in there, but people are doing well and are soon expected to be able to get out of there without boats.\nDec 3rd 11:15pm IST - Water level has receded in Kotturpuram and authorities have moved in to rescue and help..\n","","","",""],["KOYAMBEDU","Dec-04 12:00","https://www.facebook.com/groups/ChennaiFloods/permalink/1686334451580479/\n4th Dec, 12noon - Bone dry. Main roads are ok, side lanes are flooded and but they pumping out water onto the main roads, so road opposite koyambedu slight water logging\n3rd dec 11:15pm - ‪Koyambedu‬. Buses are available.","","","",""],["KOVILAMBAKKAM","Dec-03 15:45","Dec 3rd 3:45pm: Rajam Nagar Main Road, near Narayanpuram lake - water has mostly receded in quite few areas.possible to drive. Power appears to be back but there is no network coverage in the area still.\nLast spoke to my brother at 9:30PM IST on 02/12/2015. Water logging is low- moderate. Some places have electricity. Will again update information for this location at 06:00AM IST. (This status was updated at 03:54AM IST - 03/12/2015).\nAlso heard Keelkattalai signal junction is heavily flooded.\n","Power back in some areas/no network","","Keelkattalai","First hand info"],["MADIPAKKAM","Dec-04 20:00","https://www.facebook.com/groups/ChennaiFloods/permalink/1686470614900196/ \nDec 4th, 8 PM- No power no water logging, from kelkattalai to madipakkam all fine. From sadasiva nagar going forward till velachery issues due to water stagnation\nDec 4th, 11am - water level is 5 to 7 feet there but everyone is safe no need to worry they have also provided food n water supply\nDec 4 - 10AM - karthikeyapuram, madipakkam, all is well there, water is well receding, landline now working like a charm..still no power, drinking water still a problem.\nDec 4 - 9 AM Power supply not available so they may not be able to charge their mobiles...pls.wait till its up. Don't worry things are safe in those areas..\n4th DEC, 3:14 AM - GM hospital , ponniamman kovil current restored and clear sky with stars reported.\n","some areas power restored\nNo network, connections to Land Line \nphones working after multiple tries","Karthikeyapuram","KK Nagar",""],["MANAPAKKAM","Dec-04 06:00","https://www.facebook.com/groups/ChennaiFloods/permalink/1686292604917997/\nDec 4th - 6AM - Spoken 1st hand report - spoke to my Family in marvel Riverview county. According to them all fine. No power and very low connectivity but everything else fine. They are in first phase - Manapakkam.\nDec 3rd 4PM Manapakkam area,  people were able to reach the main road for supplies, water stagnation has receded ","No power, low network ","","",""],["MANDAVELLI","Dec-04 00:00","Bone Dry Power Back","Power is back","","",""],["MANGADU","Dec-04 19:00","Dec 3rd, 7PM - on ground update - most areas seem safe, no water.\n","","","","First hand info"],["METTUKUPPAM(600097)","Dec-03 05:05","Dec 3rd  5:05AM  :Secretariat colony Water level is still 10ft , No electricity people are still waiting for boats to get rescued.\n","No electricity","","",""],["MRC NAGAR","Dec-03 19:00","Dec 3rd, 7PM - on ground update - Still heavily waterlogged\n","","","","First hand info"],["MUGALIVAKKAM","Dec-03 15:50","Dec 3rd, 3:50 PM: annai velankanni nagar :Water had been receding, very little water logging. Milk and water supplies were scarce and expensive when available. No electricity in the area and mobile network's were being received only from terraces of buildings.\n","No power. Mobile networks only on terraces","","",""],["MYLAPORE","Dec-04 08:50","Road clear from anna nagar to koyambedu. milk and groceries available. shops open. power back.\nKamadhenu - Luz, RK Salai and Woodlands Petrol Stations are operational","Power is back","","",""],["MEDAVAKKAM","Dec-04 14:15","Roads are clear. Power is back ,internet and phone signal are available in some parts","Power, Phone and internet available in some parts","","","https://www.facebook.com/groups/ChennaiFloods/permalink/1686275408253050/"],["NANDAMBAKKAM","","Most people in Wood Creek county safe and in their homes. \nRescuers were there to check on and evacuate as needed","No power or cell phone reception.","","",""],["NANDANAM","Dec-04 11:15","https://www.facebook.com/groups/ChennaiFloods/permalink/1686520624895195/\nelectricity/power is back up around 9.00 PM IST.. It did rain heaily between 2 and 6 PM but that has no effect on the situation.\nChamiers Road - Knee high water. Venkateshwara hospital open. Shops closed. \n Nandanam signal to West mambalam - Water below knee-level. Groceries, \nTea shops and Medical shops OPEN. \n5:30 PM Chamiers Road, 5th Main Road through Lotus Colony dry and motorable.","No power or cell phone reception.\nWorking Bsnl Landlines","","",""],["NANGANALLUR","Dec-04 11:15","Dec 4th, 11.15am IST - MGR Road,AGS Clny,Modern School - no water.Power was available sometime back. Shops open.\nNO Flooding streets/Main rd in Nanganallur, Ramnagar Lakshmi Nagar, Hindu, Nehru colony.\nPower has resumed in 6th main road. No water logging in major parts of Nanganallur. Source\nThillaiganga Nagar - No major waterlogging, power restored, airtel is working on and off but other networks are down\n","","","",""],["NATESAN NAGAR","Dec-03 23:55","Dec 3rd - 11:55PM - PM No water on Natesan Nagar 3rd street and Main Road. ","Area has power too.","","",""],["NEELANKARAI","Dec-03 19:00","3rd Dec, 7PM IST - On ground update - no water logging, limited power available.","","","",""],["NESAPAKKAM","","sakthi nagar nesapakkam is fine","","","",""],["NUNGAMBAKKAM","Dec-03 23:15","3/12/15 - 11:15PM IST - Loyola college subway waterlogged is fully drained. Nungambakkam roads, Express avenue roads are good to go. \n3/12/15, 11pm IST - Uthamar Gandhi salai- Sterling road stretch water free. Power restored, Supermarkets open.\n\n","","","",""],["PALLAVARAM","Dec-04 18:30","Dec 4, 6:30 am IST: Route on dargah road is cleared .Power has been up for the last 12+ hours . Bsnl landlines don't work . Airtel and Vodafone call works occasionally from elevated areas (3+ floors up) \nUpdate from 6:45 am Dec 3rd; Airtel network is working, power available intermittently in Zameen Pallavaram","","","","First hand info"],["PALLIKARNAI","Dec-03 20:00","Dec 3rd, 8pm - Kamakshi hospital intersection blocked. Road leading to Kizhkattalai bus stand from 200 ft road is partially blocked as well\n2:20pm IST DEC 3rd: Pallikarnai blocked beyond Narayanapuram\n","","","",""],["PERAMBUR","Dec-04 08:00","Dec 4 - 8 AM - Mobile connectivity decent, with some buses operational.","","","",""],["PERUNGALATHUR","Dec-04 08:00","Dec 4th - Captain Sasi Kumar nagar free of water logging.","","","",""],["PERUNGUDI/KANDANCHAVADI","Dec-04 13:00","https://www.facebook.com/groups/ChennaiFloods/permalink/1686516234895634/\nDec 4th 12:00 AM - No water logging\nDec 4th 1:00pm - Kurinchi Nagar - Safe ; Elimnagar SP Infocity- no water logging, water and food available\nMGR Main road in Kandanchavadi is clear at least from Apollo Hospital till SP Infocity/ Thanthi TV building. CBI Colony Main road and whereabouts also seem clear. No power backup.","","","",""],["POLICHALUR","Dec-04 04:30","Dec 4th 4:30 am - Water receding close to Polichalur Govt Hospital Area","","","",""],["PORUR\nPOONAMALLE / POONAMALEE HIGH ROAD","Dec-04 08:30","Dec 4, 8:30 am:  Ambal nagar porur. No mobile or telephone connectivity but conditions ok.\nDec 4, 6:00 am IST - Porur Arcot Road, by pass road in perfect condition, porur junction messy yet navigable, MIOT hospital are blocked off, Porur to Guindy very poor route, SRMC college working 100%, poor cell connectivity\n","","","",""],["PORUR\nPOONAMALLE / POONAMALEE HIGH ROAD","Dec-03 23:15","Dec 3rd - 11:15pm IST - ‪#‎Poonamalle‬ High road is safe and operational.","","","",""],["RAMAPURAM","Dec-04 12:15","Dec 4th 12:15pm - Kothari Nagar safe - provisions also available. but no power and network \nDec 3rd 5:15pm - Situation is that certain houses in ground floor have water.Except for no current and no mobile or landline..things are a bit safe as of now. \nDec 3rd 2:15pm - Water receding and supplies being provided\n","","","",""],["RA PURAM","Dec-03 23:19","Dec 3rd 11:19pm -  Home center water receded. Billroth hospital still has power outrages and water logging.\nDec 3rd 4:45pm - TTK Road signal to RA Puram: no problem, but a bit of water logging near Billroth Hospital.\nhttps://www.facebook.com/singam.90?fref=ts says water receding slowly (8AM 03/12)\n","","","",""],["RK Salai","Dec-03 13:32","Update at 1:32 PM IST, Dec 3rd - Commutable roads, Power supply back.\n Food and water situation ok.","","","",""],["ROYAPETTAH","Dec-03 19:00","Dec 3rd, 7PM - on ground update - water is decreasing, power is available in most areas, but limited network\n","","","",""],["SAIDAPET","Dec-03 22:00","3rd Dec - 10PM IST - A good news from our team members Naveen Kumar and Others members from Saidapet is that, Water in Johns Road,Saidapet has drained and vehicles are moving now and In west saidapet Water level is reduced to 41/2 ft and still continues decreasing.Water is exiting through aranganathan Subway in saidapet.\n3rd Dec - 9.30 pm - Saidapet is accessible now. vehicles can move.\n3rd Dec, 7:30 p.m.: 3)  water level receding now near Jones Road. BSNL network is still down, Airtel works. No power for 36 hours\nThis group has info with pics about saidapet \nhttps://www.facebook.com/groups/187146518294944/?fref=ts\n","","","",""],["SALIGRAMAM","Dec-04 02:00","Dec 4th 2:00AM IST - No water in Saligramam. \nWater level around 1-2 ft in satyamoorthy street devraj, near prasad lab and arunachalam road, water level has reduced.power not yet restored. bread packets and milk packets are being distributed. \nDec 3rd, 2:45 PM : Arcot road: water clogging - being in first floor is safe\n","","","",""],["SANTHOME","","Report from person on Santhome high road, some patches of water, but definitely motorable - 8.30AM IST.\n","","","",""],["SHASTRI NAGAR","Dec-03 11:30","Updated at 11.30 am IST, December 3rd - Direct report from cousin - Shastri nagar, 8th cross. That water levels are coming down. People are largely indoors and safe on thus street.\n","","","",""],["SHOLINGANALLUR","Dec-04 10:00","Dec 4th - 10AM IST - on ground info - from Chennairains twitter - Sholinganallur Kumaraswamy Nagar has power restored. Internet and network is slow. ECR seems to be clearing up for travel.\n5:18PM DLF Gardens: gensets in basement flooded, no diesel.","No power as ","","",""],["TAMBARAM","Dec-04 08:00","Dec 4th 08:00AM - Water is draining in Mudichur and Tambaram areas, now only 2 to 3 feet water in mudichur that too for short stretches, power came in most of the areas. No worries and not need to panic about tambaram area.\nEast tambaram area update near rajakilpakkam: Dec 4, 630 am, no rains since yesterday. Just intermittent showers. Landlines and mobiles not working for most of us but a few numbers get connected occasionally. No flooding.\nDec 4th 1:14am - West Tambaram - Water levels are receding, and power has been restored a few hours back.\n","","","",""],["T.NAGAR","Dec-03 22:00","Dec 3rd, 22:00: Water in area has completey drained.\nDec 3rd 20:30: Venkatraman street - water levels is very less. Landlines and BSNL numbers are working intermittently\nDec 4th 21:00 IST : Internet is back on in some parts around Pondy Bazar, electricity and phone lines working. Heavy rains started again, but no signs of flooding yet","","","",""],["TEYNAMPET","Dec-03 23:19","Dec3, 2015 23:19  - Cenotaph flyover signal has completely receded and can be easily accessed","","","",""],["THIRUVANMIYUR","Dec-04 08:00","Dec 4th ~8:00AM - Thiruvanmiyur signal to tidel some flooding ","","","",""],["THORAIPAKKAM","Dec-04 05:30","4th Dec, 5.30 AM - Water is at 2 ft. NDRF is working on this area.Situation seems to be improving overall.\n","","","",""],["TIDEL_PARK AREA","","","","","",""],["THIRUVANMIYUR","Dec-04 08:00","Thiruvanmiyur signal to tidel some flooding, 2-3 ft water.","","","",""],["TRIPLICANE","","","","","",""],["URAPAKKAM","Dec-04 13:30","Water has drained away i nthe arul Nagar - Neelan school area","BSNL Lines not working; Power is back.","","",""],["VADAPALANI","Dec-04 08:40"," Dec 4th, 8.40 am: Traffic seen on 100ft Road \nDec 4th, 5:00 am: 100ft road till hotel bheemas was clear of water.MTC Buses functioning even from vadapalani bus depot saw 27C, 12B and buses towards Porur. None of the mobile towers work from vadapalani till porur\n","","","",""],["VALASARAVAKKAM","Dec-05 03:45","https://www.facebook.com/groups/ChennaiFloods/permalink/1686556258224965/\nDec 5th 3:45 AM : VALASARAVAKKAM BSNL tower just came back on. Dad had residual charge on cell from Monday. \nDec 5th 12:45 AM: They said the water levels are manageable and few shops are open along Radhakrishnan Road.\nDec 4th 12:15: Sridevikuppam main road- water reduced greatly and Kamakoti Nagar -no water logging There is intermittent power, no mobile signal\nDec 4th 10:00 am - Arcot Road has some flooding. \nDec 4, 08:00 am - Chinmaya nagar (near velankanni school) : Able to commute from Chinmaya nagar to Valasaravakkam and back without issues. Water has receded significantly on main roads. Power restored in Chimaya Nagar. No power in Valasarawakkam. Cell networks still spotty. Prices for milk / supplies marked up significantly\nDec 4th, 4.45am - Valasaravakkam and Alwarthirunagar: water levels are slowly reducing. Power is yet to resume in most parts due to stagnant water. \n\n","","","",""],["VANDALUR","","","","","",""],["VANAGARAM","","","","","",""],["VELACHERY","Dec-04 14:00","Dec 4th 14:00  – Most people from vijaynagar rescued. Still water logging slowly receding and no power\nGangai nagar evacuated and secured. Armed forces have taken over, volunteers restricted entry into vijayanagar from madippakkam side.\nDEC 3rd 4:40pm : \nDry Areas : Velachery Bye Pass road. Area from phoenix mall up to murgan kalyana mandapam clear of water. Gangai Nagar, Sakthi vijayalakshmi nagar, natesan nagar etc. \nWater logged: Buvaneshwari Nagar 2nd Main road, behind Chennai Silk","","","",""],["VELACHERY","Dec-04 09:00","Erattai Pillayar Koil Street(Near Sai Skanda Real Val homes) has water receding, and had about knee deep water this morning","","","",""],["VILLIVAKKAM","Dec-03 15:00","Manageable flooding near New Avadi Road. Power is available and essential stores are open","","","",""],["VIRUGAMBAKKAM","Dec-04 05:00","Jains and Ceebros water is ankle-length.","","","",""],["VIRUGAMBAKKAM","Dec-04 11:00","AVM avenue 4th street and Sanjay Gandhi Nagar - water logging in inside streets little worse than on main road which has got 2-3 feet water but vehicles plying","","","",""],["WEST MAMBALAM","Dec-05 04:00","Situation stable. Power expected to restored by 5 pm today","","Thiruvengadam Street","Station road, Babu rajendra prasad st near madley subway, 4-5 ft of water",""],["WEST MAMBALAM","Dec-05 04:00"," https://www.facebook.com/groups/ChennaiFloods/permalink/1686557711558153/\n Dec 05, 4 AM:  No current , Network is available for airtel alone in few places, Water logging below knee level, all the provisions are accessible\n Postal colony bus stop ankle length water, navigable.\n Karnan st, Bhaktavatchalam st navigable\n Jubilee road and Lakeview road drained\n","","","",""],["THIRUVANMIYUR","Dec-04 16:30","Waterlogging but people are safe. No power or network","No power/network","","","https://www.facebook.com/groups/ChennaiFloods/"],["SHASTRI NAGAR","Dec-04 16:55","power supply restored","power restored","","","https://www.facebook.com/groups/ChennaiFloods/"],["ADYAR","","sivagamipuram - power restored","power restored","","","https://www.facebook.com/groups/ChennaiFloods/"],["VIRUGAMBAKKAM","","Water levels receding. Power restored in some areas but phone lines are down","Power restored/no network","","","https://www.facebook.com/groups/ChennaiFloods/"],["ADAMBAKKAM","Dec-04 13:00","RT #Adambakkam Main Roads r clear of Water, interiors water logged. Autos plying btwn Velachery and Adambakkam. Food, Water supply is short","","","",""],["THORAIPAKKAM","Dec-04 16:00","Jain Housing near bridge - flooded but people are being rescued by boats. ","","","",""],["PERAMBUR","Dec-04 14:00","Dry areas (little or no water): Paper Mills Road, Madhavaram high road, Moolakadai junction, Perambur main road to Madhavaram junction\nAreas still waterlogged: Jawahar Nagar, Muthumai nagar, Periyar Nagar, Ponniyamman medu, MR Nagar","","Paper Mills Road, Madhavaram high road, Moolakadai junction, Perambur main road to Madhavaram junction","Jawahar Nagar, Muthumai nagar, Periyar Nagar, Ponniyamman medu, MR Nagar",""],["NOLUMBUR","Dec-04 17:45","Near VGN MInerva Apts - No water logging. Power restored and intermittent Vodafone network Airtel networks work better","Power restored/intermittent phone network","","","First hand info"],["PALLAVARAM","Dec-04 16:00","Dec 4, 4.00pm:Near Inayath hall, Water has receeded.","No power till now","","",""],["ASHOK NAGAR","12/5/2015 4:00:00","https://www.facebook.com/groups/ChennaiFloods/permalink/1686557711558153/\nDec 5, 4 AM.  No current and no network in almost all the places. Very minimal water loggings, provisions are already there for people,Most of the shops are accessible.\nArea back to normalcy. Everybody is getting food and water. Some people cooking in their own houses","","","",""],["KKNAGAR","Dec-04 18:00","Area is mostly back to normalcy. Everybody is getting food and water. Some people cooking in their own houses. CWPD Quarters is fine.  Bharatidasan Colony is still affected - need to mobilize resources for food and water, although nearby people are providing some help. But people are safe, and old people needing medical attention have already been taken to hospital","","","",""],["SALIGRAMAM","Dec-04 18:00","There is still some water stagnation. ","","","",""],["VALASARAVAKKAM","Dec-04 18:00","water is knee level and receding. we are looking to mobilize resources for food and water.","","","",""],["ALWARTHIRUNAGAR","Dec-04 18:00","water is knee level and receding. we are looking to mobilize resources for food and water.Balaji nagar,Alwarthirunagar - Water is around 1.5 feet. shops have also opened.","Dec 4, 10:00 AM - Phone lines are down...both landline and cell phones. ","","",""],["VIRUGAMBAKKAM","Dec-04 18:00","There is still some water stagnation. Jains ashraya apartments in vembuli Amman koil street is damaged till ground floor and people have been moved to the upper floors and nearby safe places. ","","","",""],["SALIGRAMAM","Dec-04 18:00","Kambar Street and 1st Main Road near Vinayagam Ave- Both places have knee-deep water still, although it seems to be receding. They had some heavy intermittent showers but nothing too bad. Power is intermittent (was on for a few hours yesterday and just came now; enough to charge phones). ATMs dont have any money. Medical shops are open. Not navigable by motorbike, though.","","","",""],["THORAIPAKKAM","Dec-04 18:00","However, the main road is relatively clear of water. IN some areas with water, people are safe if they stay put at home. People commute by boat between apartments. .  Karapakkam is still a little flooded. ","","","",""],["ABHIRAMAPURAM/ALWARPET","","Foreshore Estate Airtel office to Park Sheraton full straight is motorable. Water logged from Kaliappa to Park Sheraton","","","","https://twitter.com/rj_manutd/status/672770665171181569"],["NUNGAMBAKKAM","Dec-04 19:00","Waterlogging on santhome high rd (near hotel palmshore) & one lane in Nungambakkam high road till Gemini for 300 yards. Chetpet bridge made two-way.","","","",""],["ADYAR","Dec-04 18:00","Karpagam gardens: Landlines working for the past 2 hours, Occasional cell phone (mostly vodafone) signal from terrace. Water has been receding and pumped out occasionally until noon or so. Intermittent rains/ heavy rains in the afternoon for 20 mins.  Adyar area would get power for 2 hours only once the water logging is at safe levels","","","",""],["BESANT NAGAR","","Near Ashtalakshmi temple area: Water has been receding and pumped out occasionally until noon or so. Intermittent rains/ heavy rains in the afternoon for 20 mins. ","","","",""],["RAMAPURAM","Dec-04 18:00","Asvini Atrium water completely drained, traffic has resumed on Valluvar salai.","Working scarcely and intermittently. Keep trying until you gain contact.","","",""],["ADYAR","Dec-04 18:00","Kasturba Nagar 4th and 5th Main Road have 2ft water.","Power is on.","","","https://twitter.com/ajit_bhaskar/status/672754805463379968"],["KKNAGAR","Dec-04 21:00","On ground live update - Near PSBB and Lakshmanasamy Salai - very little water on road. Heavy rains let up, but still drizziling right now","power there since yesterday, low voltage, phone networks still poor","","",""],["PADUR","Dec-04 18:07","Roads towards Thiruporur not motorable for small cars due to some damage near Thayyur. Only CVs can go","","","",""],["CHOOLAIMEDU","Dec-04 18:06","Waterlogging up to 3 ft, mixed with sewer water.","","","","https://twitter.com/rakeshkhabiya/status/672756425412636672"],["T.NAGAR","Dec-04 18:17","IDBI Bank ATM on Dr. Nair Road and Syndicate Bank ATM opposite Residency are working.","","","","https://twitter.com/AidOffered/status/672759140821934081"],["VILLIVAKKAM","Dec-04 18:17","Almost no water logging on the roads, except at the Bus Depot. Normal traffic right now.","","","","https://twitter.com/ChennaiRainsOrg/status/672759612345442304"],["EKKATUTHANGAL","Dec-04 18:28","All retired defence personnel have been rescued and housed in the Military hospital. All civilians in the area are in Cantonment Centre in St. Thomas mount.","","","","https://twitter.com/ChennaiRainsOrg/status/672761873821908992"],["PALLAVARAM","Dec-04 18:40","Roads are motorable up to Vels University.","","","","https://twitter.com/ChennaiRainsOrg/status/672764993738137600"],["THIRUVANMIYUR","Dec-04 21:33","","Power restored in parts of the area near Shankara colony","","",""],["BESANT NAGAR","Dec-04 21:33","","Power restored in Besant Nagar, Rukmini Road, and nearby areas.","","",""],["PAMMAL","Dec-04 21:43","Is back to normal. Only petrol is on demand","","","",""],["ALWARTHIRUNAGAR","Dec-04 13:30","Lamech school road area all fine","Some cell towers working. Power yet to come.","","",""],["VELACHERY","Dec-04 21:50","Electricity restored, no network connectivity yet.","Power yes, phones not yet.","","",""],["ASHOK NAGAR","Dec-04 22:00","f47th street, 9th avenue - raining on and off, no stagnant water on 47th street, but no power and bad network.","No power / bad phone signal","","",""],["VALASARAVAKKAM","Dec-04 22:30","Area near 108 majestic colony - people are safe ","","","",""],["PALAVAKKAM","Dec-04 18:30","No water stagnation, roads dry. Shops open. Seems safe.\nTelephone connections (BSNL landline) intermittent.","Power not up. Since one of the supply boards is in contact with stagnated water - power may not be up till Monday. Mobile networks seem to work, but no electricity.","","",""],["ROUTE: BANGALORE TO CHENNAI","","5 Cars have made it to Bangalore via Chetpet - Aminjikarai - Poonamallee. The road till Bangalore is dry. Sriperambadur and Kanchipuram are not flooded! Take the Parry's - Central and reach Chetpet, cross Anna Arch and stick to the highway. Stay close to the median in case they are clogged. All the buses are running from Koyambedu","-NA-","","",""],["ROUTE: KANCHIPURAM_KOYAMBEDU","","The road is quite good. There are areas that have potholes, but no water logging at all","","","",""],["PORUR\nPOONAMALLE / POONAMALEE HIGH ROAD","Dec-04 10:00","Porur signal is free to vehicular traffic since morning","","","",""],["SALIGRAMAM","Dec-04 22:00","Rajaji Colony - all seems fine. Power and phone connectivity stil bad, but safe for now.","Power, phone situation still bad. But area is safe.","","",""],["TEYNAMPET","","Roads clear from Eldams road till Adyar","","","",""],["ARUMBAKKAM","Dec-04 22:35","Not more than ankle high water, no one stuck anywhere","No power","","",""],["ROUTE: KOTTURPURAM BRIDGE","","Bridge closed, do not use","","","",""],["ROUTE: Billroth Hospital signal to Music College via Mylapore","","no problem except for a bit of water logging near the playground next to Music College.","","","",""],["ROUTE: Greenways Road signal to Boat Club area","","water logging on the stretch","","","",""],["NAVALUR","Dec-04 23:00","No waterlogging, situation seems good","Power coming back, Internet coming back in parts too","","",""],["ROUTE:Perungudi","","Toll plaza motorable","","","",""],["ROUTE: TTK Road signal to RA Puram","","no problem, but a bit of water logging near Billroth Hospital.","","","",""],["ROUTE: Adyar signal to Thiruvanmiyur signal","","no problem","","","",""],["ROUTE: Adyar Bridge","","no problem, but the Adyar Flyover is closed.","","","",""],["ROUTE: Routes to OMR","","heavy water logging towards Buckingham Canal AND towards Tidel Park SIGNAL (basically the only 2 options to reach the OMR)","","","",""],["ROUTE: #‎MCITY‬ TO ‪#‎GUINDY","","the roads are clear. No water logging and moving traffic. Shops are open.","","","",""],["ROUTE: Mylapore to T Nagar","","along TTK Road, Eldams Road, Nandanam: 2-3 feet of water, advised not to travel there.","","","",""],["ROUTE: Koyembedu flyover to Chetpet Bridge","","Absolutely no problem on the roads.","","","",""],["ROUTE: Chetpet Bridge to Gemini","","again, no problem, except for a bit of water logging on Nungambakkam High Road.","","","",""],["ROUTE: Gemini to TTK Road signal","","no problem.","","","",""],["ROUTE: Post OMR","","Perungudi toll Plaza motorable","","","",""],["ROUTE: From City towards ECR","","Turn left towards thiruvanmiyur...there are pockets of waterlogging but motorable","","","",""],["VELACHERY","Dec-04 23:50","Dandaneeswaram Nagar, no problems","","","",""],["KKNAGAR","Dec-05 00:40","R.K.Shanmugam salai, K.K. Nagar. Current has been restored.Waterr logging (knee level) near Double tank in R.K.Shanmugam salai.","Some landline working.","Areas around ESI, Sivan Park, Anna main road","",""],["NANDANAM","Dec-05 00:40","Areas in and around 10th street, bajaj apartments, Nandanam - dried up with only patches of water here and there. It did rain heaily between 2 and 6 PM but that has no effect on the situation. Also near new tower block and 4th street water has drained down to ground level. Anna Salai also dried considerably.","Electricity/power is back up around 9.00 PM IST","10th Street, New tower block, 4th street, parts of Anna salai near nandanam","",""],["ANNA NAGAR/MOGAPPAIR","Dec-04 22:00","Shanti Colony: No water logging. power back. Some phone connectivity","","","",""],["VILLIVAKKAM","Dec-04 23:45","SIDCO Nagar 5ft water, corporation pumping out slowly.","","","",""],["PALLIKARNAI","Dec-04 22:40","Water around balaji dental college has about 3 feet of water","","","",""],["KOTTUR","Dec-05 00:30","Shops are open n some ATMs in #Kottur have started working. Cellphone networks are working fine too. Electricity is also back","Cellphone networks are working fine too. Electricity is also back","","",""],["VALASARAVAKKAM","Dec-05 00:30","close to Arcot road near Lamech School (Ceebros Park) water levels are manageable and few shops are open along Radhakrishnan Road.  shops are running out of essentials like mineral water and it's also very difficult to get milk and vegetables. The power is on and off, and mobile networks has started to function in the area.\nValasaravakkam -Kesavarthini area. Things are OK. Water logging is not bad. Essentials are available in the area.","Power connectivity is on and off. Spotty telephone connectivity.","","",""],["MADIPAKKAM","Dec-04 23:00","Ramnagar and Kuberan nagar still water logged but people have been well taken care of. Places until Ramnagar bus stop are dry, shops open. Water levels receding and should be completely drained by noon tomorrow, if no rains.","","","",""],["PALLAVARAM","Dec-05 00:30","No flooding in Zamin/old Pallavaram. \narea near dharga road is clear. \nMain bus stand in Pallavaram on the GST road has no water stagnation. ","","","",""],["VELACHERY","Dec-05 01:50","https://www.facebook.com/groups/ChennaiFloods/permalink/1686524618228129/\nTansi, Baby, Udayam and Ram Nagar flooded - 4ft water","","","",""],["GIRUGAMBAKKAM","Dec-05 00:30","Factory area. Water levels are receding on the ground floor. People are safe and there is food and water. ","Still poor connectivity, limited power. But safe.","","",""],["VIRUGAMBAKKAM","Dec-04 23:00","vembuliamman koil street, virugambakkam - spoke to police commisioner - water logging still there - but is coming down fast and should be done by noon.","Power out still due to water logging, but people safe. Mobile networks down.","","",""],["ROUTE: CHENNAI TO BANGALORE","Dec-05 02:30","From thoraipakkam to Madhya kailash to guindy to porur - Bangalore highway. Crossing vellore now.. Except porur, water completely drained out from the roads. Porur only 1ft water . outside porur little showers only from today evening. Friends were able to reach koyembedu through OMR. Saidapet buses , 19b Paris buses are operational. From kathipara to porur no tower signal. Its still in black box. ","Bsnl landline connections are getting restored in porur now. Ppl can listen to 104.8 who gives many information.","","",""],["VALASARAVAKKAM","Dec-05 03:45","","BSNL towers back on.","","",""],["RAMAPURAM","Dec-05 03:00","Park Dugar Area ok. Only power was lost. No significant water logging issues.","","","",""]]}
